Revit 2026 API

# EquipmentClassification Enumeration

---

This enumeration is used to classify the mechanical equipment.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum EquipmentClassification
```
```vb
Public Enumeration EquipmentClassification
```
```cpp
public enum class EquipmentClassification
```
```fsharp
type EquipmentClassification
```

| Member name | Value | Description |
| --- | --- | --- |
| None | 0 | The undefined equipment type. |
| Pump | 5 | The pump equipment. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace